ОтображениеГрафов/src/Catalogs/граф_ЭлементыГрафа/граф_ЭлементыГрафа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>граф_ЭлементыГрафа</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.граф_ТипЭлементаГрафа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЭлементаJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОтображениеГрафов/src/Enums/граф_ТипЭлементаГрафа/граф_ТипЭлементаГрафа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>граф_ТипЭлементаГрафа</name>
  <enumValues>
    <name>Вершина</name>
  </enumValues>
  <enumValues>
    <name>Ребро</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

ОтображениеГрафов/src/Catalogs/граф_ЭлементыГрафа/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КешированныйШаблонТекстаСтраницы = ПолучитьОбщийМакет("граф_ШаблонHTML").ПолучитьТекст();
	КешированныйТекстБиблиотека = ПолучитьОбщийМакет("граф_БиблиотекаG6Версия4").ПолучитьТекст();
	КешированныйСкриптИнициализации = ПолучитьОбщийМакет("граф_СкриптИнициализацииГрафа").ПолучитьТекст();
	ЗакешироватьТекстТипаЭлемента();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипЭлементаПриИзменении(Элемент)
	ЗакешироватьТекстТипаЭлемента();
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЭлементаJSONПриИзменении(Элемент)
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗакешироватьТекстТипаЭлемента()
	Если Объект.ТипЭлемента = Перечисления.граф_ТипЭлементаГрафа.Ребро Тогда
		КешированныйТекстТипаЭлемента = Справочники.граф_ЭлементыГрафа.ПолучитьМакет("ШаблонРеброПоУмолчанию").ПолучитьТекст();
	ИначеЕсли Объект.ТипЭлемента = Перечисления.граф_ТипЭлементаГрафа.Вершина Тогда
		КешированныйТекстТипаЭлемента = Справочники.граф_ЭлементыГрафа.ПолучитьМакет("ШаблонВершинаПоУмолчанию").ПолучитьТекст();
	ИначеЕсли Объект.ТипЭлемента = Перечисления.граф_ТипЭлементаГрафа.Контейнер Тогда
		КешированныйТекстТипаЭлемента = Справочники.граф_ЭлементыГрафа.ПолучитьМакет("ШаблонКонтейнерПоУмолчанию").ПолучитьТекст();	
	Иначе
		ВызватьИсключение "Некорректный тип элемента";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодДляПросмотраЭлемента()
	ШаблонТекстаСтраницы = СтрЗаменить(КешированныйШаблонТекстаСтраницы, "//содержимое библиотеки", КешированныйТекстБиблиотека);
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "//инициализация графа", КешированныйСкриптИнициализации);
	ОписаниеОбъекта = СтрЗаменить(КешированныйТекстТипаЭлемента,"//свойства объекта", Объект.ОписаниеЭлементаJSON);
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "//данные графа", ОписаниеОбъекта);
	ВнешнийВид = ШаблонТекстаСтраницы;
КонецПроцедуры
#КонецОбласти
